Revit 2026 API

# AnalysisDisplayStyleSetName Method

---

Set name of analysis display style element.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetName(
	string name
)
```
```vb
Public Sub SetName (
	name As String
)
```
```cpp
public:
void SetName(
	String^ name
)
```
```fsharp
member SetName :
        name : string -> unit
```

#### Parameters

name String
     Analysis display style element name to be set.

| Exception | Condition |
| --- | --- |
| ArgumentException | name is not unique in document. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace